# KilonewtonMetersPerDegree Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KilonewtonMetersPerDegree Property
UnitTypeId Class See Also
---
Kilonewton meters per degree.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KilonewtonMetersPerDegree { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KilonewtonMetersPerDegree As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KilonewtonMetersPerDegree {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace